Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: For this use case, user `guest` configured above needs to be a RabbitMQ admin user with the capability to create credentials.
ja_jp: このユースケースでは、上記で設定されたユーザー `guest` は、クレデンシャルの作成機能を持つ RabbitMQ 管理者ユーザーである必要があります。

source: For this, both Jackson and JSON-B extensions provide a way to register serializer/deserializer from within an extension deployment module.
ja_jp: このため、Jackson 拡張モジュールと JSON-B 拡張モジュールの両方で、エクステンション内からシリアライザ/デシリアライザを登録する方法を提供しています。

source: For this, you can use an `Emitter`.
ja_jp: この場合には `Emitter` が利用できます。

source: For this, you need to create a class (a POJO) that will only contain the projected fields. This POJO needs to be annotated with `@ProjectionFor(Entity.class)` where `Entity` is the name of your entity class. The field names, or getters, of the projection class will be used to restrict which properties will be loaded from the database.
ja_jp: そのためには、投影されたフィールドのみを含むクラス（POJO）を作成する必要があります。このPOJOには、 `@ProjectionFor(Entity.class)` でアノテーションを付ける必要があります。 `Entity` はエンティティ・クラスの名前です。プロジェクション・クラスのフィールド名（ゲッター）は、データベースから読み込まれるプロパティを制限するために使用されます。

source: For those who don't know, Quarkus Insights is a (almost) weekly video/audio podcast where we host people from all parts of the Quarkiverse to sit down and talk about how to use Quarkus, what is coming next, user stories from the actual users and more!
ja_jp: ご存知ない方のために説明しますと、Quarkus Insightsは（ほぼ）週1回のビデオ／オーディオポッドキャストで、Quarkiverseの様々な分野の方々をお招きして、Quarkusの使い方、次の展開、実際のユーザーからのユーザーストーリーなどについてお話していただいています。

source: For topics that already contain v2 messages, valid migration approaches are:
ja_jp: 既に v2 メッセージを含むトピックの場合、有効な移行アプローチは次のとおりです。

source: For topics with mixed v2/v3 messages, consider using the `OptimisticFallbackIdHandler` described in the <<Optimistic Fallback ID Handler>> section.
ja_jp: 混合 v2/v3 メッセージを含むトピックの場合、<<optimistic-fallback-id-handler,Optimistic フォールバック ID ハンドラー>> セクションで説明されている `OptimisticFallbackIdHandler` の使用を検討してください。

source: For traditional databases, automatic binding is initiated whenever a datasource is configured as follows:
ja_jp: 従来のデータベースの場合、データソースが以下のように設定されるたびに自動バインディングが開始されます。

source: For true rock stars, the road never ends.
ja_jp: 真のロックスターにとって、道に終わりはありません。

source: For usage questions, we recommend to:
ja_jp: 利用方法については、以下でお問い合わせ頂くことをお勧めします：

source: For use with a built-in JDBC driver, choose and add the Quarkus extension for your relational database driver from the list below:
ja_jp: 組み込みの JDBC ドライバーで使用する場合は、以下のリストからリレーショナルデータベースドライバー用の Quarkus エクステンションを選択して追加します。

source: For use with a custom JDBC driver, add the `quarkus-agroal` dependency to your project alongside the extension for your relational database driver:
ja_jp: カスタム JDBC ドライバーと共に使用する場合は、リレーショナルデータベースドライバーのエクステンションと一緒に、 `quarkus-agroal` 依存関係をプロジェクトに追加します：

source: For users familiar with the fundamentals, this section provides an overview and code samples to set up data sources quickly.
ja_jp: このセクションでは、基礎的な内容に慣れているユーザー向けに、データソースを素早くセットアップするための概要とコード・サンプルを提供します。

source: For users familiar with the fundamentals, this section provides an overview and code samples to set up datasources quickly.
ja_jp: このセクションでは、基礎を理解しているユーザー向けに、データソースをすばやく設定するための概要とコードサンプルを示します。

source: For users that prefer to keep the `application.properties` independent of the deployment platform, the deployment target can be specified directly in the deploy command by adding `-Dquarkus.kubernetes.deployment-target=knative` in addition to `-Dquarkus.knative.deploy=true`. Furthermore, Quarkus allows collapsing the two properties into one: `-Dquarkus.knative.deploy=true`.
ja_jp: `application.properties` をデプロイメントプラットフォームから独立させたいユーザーのために、`-Dquarkus.knative.deploy=true` に加えて `-Dquarkus.kubernetes.deployment-target=knative` を追加することで、デプロイコマンドでデプロイメントターゲットを直接指定することができます。さらに、Quarkusでは、この2つのプロパティーを 1 つにまとめることができます (`-Dquarkus.knative.deploy=true`）。

source: For users that prefer to keep the `application.properties` independent of the deployment platform, the deployment target can be specified directly in the deploy command by adding `-Dquarkus.kubernetes.deployment-target=openshift` in addition to `-Dquarkus.kubernetes.deploy=true`. Furthermore, Quarkus allows collapsing the two properties into one: `-Dquarkus.openshift.deploy=true`.
ja_jp: `application.properties` をデプロイメントプラットフォームから独立させたいユーザーのために、`-Dquarkus.kubernetes.deploy=true` に加えて `-Dquarkus.kubernetes.deployment-target=openshift` を追加することで、デプロイコマンドでデプロイメントターゲットを直接指定することができます。さらに、Quarkusでは、この2つのプロパティーを 1 つにまとめることができます (`-Dquarkus.openshift.deploy=true`)。

source: For using `KafkaCompanion` API in tests, start by adding the following dependency:
ja_jp: テストで `KafkaCompanion` API を使用するには、以下の依存関係を追加して開始します。

source: For validation to work, the `quarkus-hibernate-validator` extension is required, and it is performed automatically.
ja_jp: 検証が機能するためには、 `quarkus-hibernate-validator` のエクステンションが必要で、自動的に実行されます。

source: For validation to work, the `quarkus-hibernate-validator` extension is required.
ja_jp: 検証が機能するためには、 `quarkus-hibernate-validator` のエクステンションが必要です。

source: For version `7.4.x` and `7.5.x`, due to an issue with the Confluent Schema Serializer, you need to add another dependency:
ja_jp: バージョン `7.4.x` および `7.5.x` では、Confluent スキーマシリアライザーに問題があるため、別の依存関係を追加する必要があります：

source: For versions `7.4.x` and later, due to an issue with the Confluent Schema Serializer, you need to add another dependency:
ja_jp: バージョン `7.4.x` 以降では、Confluent スキーマシリアライザーの問題のため、別の依存関係を追加する必要があります：

source: For very large applications, the results are just as impressive: **we were able to reduce startup time by `71%`**.
ja_jp: 非常に大規模なアプリケーションでも、結果は同様に印象的です。**起動時間を `71%` 削減できました**。

source: For well-known OIDC or OAuth2 providers, such as Apple, Facebook, GitHub, Google, Microsoft, Spotify, and Twitter, Quarkus can help significantly simplify your application's configuration with the `quarkus.oidc.provider` property. Here is how you can integrate `quarkus-oidc` with GitHub after you have link:https://docs.github.com/en/developers/apps/building-oauth-apps/creating-an-oauth-app[created a GitHub OAuth application]. Configure your Quarkus endpoint like this:
ja_jp: Apple、Facebook、GitHub、Google、Microsoft、Spotify、Twitter などのよく知られた OIDC または OAuth2 プロバイダーの場合、Quarkus は `quarkus.oidc.provider` プロパティーを使用して、アプリケーションの設定を大幅に簡素化できます。 link:https://docs.github.com/en/developers/apps/building-oauth-apps/creating-an-oauth-app[GitHub OAuth アプリケーションを作成] した後に、 `quarkus-oidc` を GitHub と統合する方法は次のとおりです。 Quarkus エンドポイントを次のように設定します。

source: For well-known OIDC or OAuth2 providers, such as Apple, Facebook, GitHub, Google, Microsoft, Spotify, and X (formerly Twitter), Quarkus can help significantly simplify your application's configuration with the `quarkus.oidc.provider` property.
ja_jp: Apple、Facebook、GitHub、Google、Microsoft、Spotify、X (旧 Twitter) などのよく知られた OIDC または OAuth2 プロバイダーの場合、Quarkus は `quarkus.oidc.provider` プロパティーを使用して、アプリケーションの設定を大幅に簡素化できます。

source: For well-known OIDC or OAuth2 providers, such as Apple, Facebook, GitHub, Google, Microsoft, Spotify, and X (formerly Twitter), Quarkus can help significantly simplify your application's configuration with the `quarkus.oidc.provider` property. Here is how you can integrate `quarkus-oidc` with GitHub after you have link:https://docs.github.com/en/developers/apps/building-oauth-apps/creating-an-oauth-app[created a GitHub OAuth application]. Configure your Quarkus endpoint like this:
ja_jp: Apple、Facebook、GitHub、Google、Microsoft、Spotify、X (旧 Twitter) などのよく知られた OIDC または OAuth2 プロバイダーの場合、Quarkus は `quarkus.oidc.provider` プロパティーを使用して、アプリケーションの設定を大幅に簡素化できます。 llink:https://docs.github.com/en/developers/apps/building-oauth-apps/creating-an-oauth-app[GitHub OAuth アプリケーションを作成] した後に、 `quarkus-oidc` を GitHub と統合する方法は次のとおりです。 Quarkus エンドポイントを次のように設定します。

source: For xref:datasource.adoc#extensions-and-database-drivers-reference[supported databases], the link:{hibernate-orm-docs-url}#database-dialect[Hibernate ORM dialect] does not need to be set explicitly: it is selected automatically based on the datasource.
ja_jp: xref:datasource.adoc#extensions-and-database-drivers-reference[サポートされているデータベース] では、 link:{hibernate-orm-docs-url}#database-dialect[Hibernate ORM ダイアレクト] は 明示的に設定する必要はありません。 データソースに基づいて自動的に選択されます。

source: For xref:multiple-persistence-units[named persistence units], use `@PersistenceUnitExtension("nameOfYourPU")`
ja_jp: xref:multiple-persistence-units[名前付き永続化ユニット] の場合、 `@PersistenceUnitExtension("nameOfYourPU")` を使用します

source: For xref:multiple-persistence-units[named persistence units], use `@PersistenceUnitExtension("nameOfYourPU")`.
ja_jp: xref:multiple-persistence-units[名前付き永続化ユニット] の場合は、 `@PersistenceUnitExtension("nameOfYourPU")` を使用します。

source: For years, the client-server architecture has been the de-facto standard to build applications. But a significant shift happened. The <em>one model rules them all</em> age is over. A new range of applications and architectural styles have emerged and transformed how code is written and how applications are deployed and executed. HTTP microservices, reactive applications, event-driven architecture, and serverless are now central players in modern systems.
ja_jp: 長年、アプリケーションを構築する際には、クライアント・サーバ・アーキテクチャがデファクト・スタンダードとなっていました。しかし、大きな変化が起こりました。<em>1つのモデルがすべてを支配する</em>時代は終わりました。新しい種類のアプリケーションやアーキテクチャスタイルが登場し、コードの書き方やアプリケーションのデプロイ方法、実行方法を一変させました。HTTPマイクロサービス、リアクティブアプリケーション、イベント駆動型アーキテクチャ、サーバーレスなどが、現代のシステムの中心的な担い手となっています。

source: For your unit tests, you can also invoke on the mock event server using any HTTP client you want. Here's an example using rest-assured. Quarkus starts up a separate Mock Event server under port 8081. The default port for Rest Assured is automatically set to 8081 by Quarkus so you can invoke on this endpoint.
ja_jp: 単体テストでは、必要な HTTP クライアントを使用して模擬イベントサーバーで呼び出すこともできます。これは、rest-assured を使用した例です。Quarkus は、ポート 8081 で別の Mock Event サーバーを起動します。Rest Assured のデフォルトポートは、Quarkus により自動的に 8081 に設定されるため、このエンドポイントで呼び出すことができます。

source: For your unit tests, you can also invoke on the mock event server using any HTTP client you want. Here's an example using rest-assured. Quarkus starts up a separate Mock Event server under port 8081. The default port for Rest Assured is automatically set to 8081 by Quarkus, so you can invoke on this endpoint.
ja_jp: 単体テストでは、必要な HTTP クライアントを使用して模擬イベントサーバーで呼び出すこともできます。これは、rest-assured を使用した例です。Quarkus は、ポート 8081 で別の Mock Event サーバーを起動します。Rest Assured のデフォルトポートは、Quarkus により自動的に 8081 に設定されるため、このエンドポイントで呼び出すことができます。

source: Force redirect HTTPS scheme
ja_jp: HTTPS スキームへの強制リダイレクト

source: Force that a resource identifier URL has an HTTPS scheme
ja_jp: リソース識別子 URL に HTTPS スキームを強制する

source: Forced JWK cache refresh interval in minutes which is used to restrict the frequency of the forced refresh attempts which may happen when the token verification fails due to the cache having no JWK key with a `kid` property matching the current token's `kid` header. It will be ignored unless the `mp.jwt.verify.publickey.location` points to the HTTP or HTTPS URL based JWK set.
ja_jp: 強制 JWK キャッシュ更新間隔 (分単位)。現在のトークンの `kid` ヘッダーと一致する `kid` プロパティーを持つ JWK キーがキャッシュにないためにトークンの検証が失敗した場合に発生する可能性がある強制更新の試行頻度を制限するために使用されます。 `mp.jwt.verify.publickey.location` が HTTP または HTTPS URL ベースの JWK セットを指していない限り、無視されます。

source: Forced JWK cache refresh interval in minutes, which is used to restrict the frequency of the forced refresh attempts that might happen when the token verification fails due to the cache having no JWK key with a `kid` property matching the current token's `kid` header. It is ignored unless the `mp.jwt.verify.publickey.location` points to the HTTP or HTTPS URL-based JWK set.
ja_jp: 強制 JWK キャッシュ更新間隔 (分単位)。現在のトークンの `kid` ヘッダーと一致する `kid` プロパティーを持つ JWK キーがキャッシュにないためにトークンの検証が失敗した場合に発生する可能性がある強制更新の試行頻度を制限するために使用されます。 `mp.jwt.verify.publickey.location` が HTTP または HTTPS URL ベースの JWK セットを指していない限り、無視されます。

source: Form Based Authentication
ja_jp: フォームベース認証

source: Form Parameters
ja_jp: フォームパラメーター

source: Form parameter
ja_jp: フォームパラメーター

source: Form parameters can also be specified using `@ClientFormParam`, similar to `@ClientQueryParam`:
ja_jp: フォームパラメーターは、 `@ClientQueryParam` と同様に `@ClientFormParam` を使用して指定することもできます：

source: Form parameters can be specified using `@RestForm` (or `@FormParam`) annotations:
ja_jp: フォームパラメーターは、 `@RestForm` (または `@FormParam`) アノテーションを使用して指定できます。

source: Form-based authentication
ja_jp: フォームベース認証

source: Form-based authentication configuration reference
ja_jp: フォームベース認証の設定リファレンス

source: Form-based authentication mechanism
ja_jp: フォームベース認証メカニズム

source: Format mappers *must* have both `@PersistenceUnitExtension` and either `@JsonFormat` or `@XmlFormat` CDI qualifiers applied.
ja_jp: フォーマットマッパーには、 `@PersistenceUnitExtension` と、 `@JsonFormat` または `@XmlFormat` CDI 修飾子のいずれかが適用されている *必要* があります。

source: Format of `import.sql`
ja_jp: `import.sql` のフォーマット

source: Fortunately React has a neat little feature called *proxy* which forwards all requests for unknown endpoints to another URL. In the */webapp* folder open the file *package.json* and add the proxy line forwarding everything to our Quarkus port on 8080:
ja_jp: 幸いなことに、Reactには未知のエンドポイントへのすべてのリクエストを別のURLに転送する *proxy* というちょっとした機能があります。 *webapp* フォルダで *package.json* ファイルを開き、proxyの行を追加して、すべてのリクエストをQuarkusのポート8080に転送します。

source: Fortunately, Quarkus provides a massive ecosystem that is ready to be used in virtual threads. Mutiny, the reactive programming library used in Quarkus, and the Vert.x Mutiny bindings provides the ability to write blocking code (so, no fear, no learning curve) which do not pin the carrier thread.
ja_jp: 幸いなことに、Quarkus は仮想スレッドですぐに使用できる大規模なエコシステムを提供しています。 Quarkus で使用されるリアクティブプログラミングライブラリーである Mutiny と Vert.x Mutiny バインディングは、キャリアースレッドをピン留めしないブロッキングコード (したがって、恐れる必要はなく、学習曲線もありません) を記述する機能を提供します。

source: Fortunately, it is possible to control when the initialization should happen: the `quarkus.cassandra.init.eager-init` parameter determines if the `QuarkusCqlSession` bean should be initialized on its first access (lazy) or when the application is starting (eager). The default value of this parameter is `false`, meaning the init process is lazy: the `QuarkusCqlSession` bean will be initialized lazily on its first access – for example, when there is a first REST request that needs to interact with the Cassandra database.
ja_jp: 幸いにも、初期化のタイミングを制御できます。 `quarkus.cassandra.init.eager-init` パラメーターは、 `QuarkusCqlSession` bean を最初にアクセスしたタイミング (lazy) または、アプリケーションが起動するタイミング (eager) のいずれで初期化するべきかを判断します。このパラメーターのデフォルト値は、 `false` で、init プロセスが遅延設定されていることを意味しています。たとえば、Cassandra データベースと対話する必要がある最初の REST 要求がある場合に、 `QuarkusCqlSession` bean は、遅延して、最初にアクセスしたタイミングで初期化されます。

source: Fortunately, other bits were already there in Quarkus, such as support for command mode applications, a rest client, the Vault extension, and support for the Fabric8 Kubernetes Client, which provided a nice base for a new OpenShift Client extension that was added to the core. The Kubernetes Client extension alone was a huge push for the project because when we started we did not have Argo available, so we had to implement _apply_ and _prune_ ourselves.
ja_jp: 幸いなことに、コマンドモードアプリケーションのサポート、restクライアント、Vaultエクステンション、Fabric8 Kubernetes Clientのサポートなど、他の部分はすでにQuarkusに存在しており、コアに追加された新しいOpenShift Clientエクステンションのベースとなりました。Kubernetes Clientエクステンションだけでも、プロジェクトにとって大きな後押しとなりました。というのも、スタート時にはArgoが利用できなかったので、 _apply_と _prune_ を自分たちで実装しなければならなかったからです。

source: Forward parameters
ja_jp: 転送パラメーター

source: Found a security vulnerability in Quarkus, its extensions or the dependencies they use? See the <a href="{{site.baseurl}}/security">security policy page</a> to learn to report it.
ja_jp: Quarkus、あるいはそのエクステンション、依存関係にセキュリティ脆弱性を見つけましたか？報告方法について、<a href="{{site.baseurl}}/security">セキュリティポリシーページ</a>を確認下さい。

source: Fragment Definition in `item.html`
ja_jp: `item.html` 内でのフラグメントの定義

source: Fragment Definition in `items.html`
ja_jp: `items.html` におけるフラグメントの定義

source: Fragments
ja_jp: フラグメント

source: Fragments can be defined with the `{#fragment}` section. Each fragment has an identifier that can only consist of alphanumeric characters and underscores.
ja_jp: フラグメントは `{#fragment}` セクションで定義することができます。 各フラグメントは、英数字とアンダースコアのみからなる識別子を持ちます。

source: French follows the same pattern:
ja_jp: フランス語も同じパターンに従います。

source: Frequently Asked Questions
ja_jp: よくある質問

source: Frequently asked questions about writing extensions
ja_jp: エクステンションの作成に関するよくある質問

source: From 3.32, you can also pass through parameters on the method call. For example,
ja_jp: 3.32 からは、メソッド呼び出しでパラメーターを渡すこともできます。たとえば、次のようになります。

source: From ARM/64 to AMD/64
ja_jp: ARM/64 から AMD/64 へ

source: From Quarkus's perspective, this is controlled by the <<quarkus-hibernate-orm_quarkus-hibernate-orm-validation-mode,`quarkus.hibernate-orm.validation.mode` configuration property>>. The available validation modes are:
ja_jp: Quarkus の観点からは、これは <<quarkus-hibernate-orm_quarkus-hibernate-orm-validation-mode,`quarkus.hibernate-orm.validation.mode` 設定プロパティー>> によって制御されます。利用可能なバリデーションモードは以下の通りです。

source: From WebJars
ja_jp: WebJarsから

source: From a GraalVM points-to analysis perspective, what happens in these method overrides matters, even if the application does not explicitly call them. This is because these methods are used throughout the JDK, and all it takes is for one of those calls to be done on an unconstrained type, e.g. `java.lang.Object`, for the analysis to have to pull all implementations of that particular method.
ja_jp: GraalVM ポイントツー分析の観点からは、アプリケーションが明示的に呼び出さなくても、これらのメソッドオーバーライドで何が起こるかが問題になります。これは、これらのメソッドが JDK 全体で使用されているためであり、これらの呼び出しの 1 つが制約のない型 (たとえば、`java.lang.Object`) で実行されるだけで、分析でその特定のすべての実装をプルする必要があるためです。方法。

source: From a directory with no pom.xml and without any further options, the generator will automatically pick the 'standalone' extension layout
ja_jp: それ以上のオプションなしで、pom.xml のないディレクトリから、ジェネレーターは自動的に 'standalone' 拡張レイアウトを選択します。

source: From a local directory
ja_jp: ローカルディレクトリから

source: From an end user perspective, it brings a better UI, more flexibility and code examples.
ja_jp: エンドユーザーの視点から見ると、より良い UI、より柔軟性のあるコード例をもたらします。

source: From an extension developer standpoint the Maven publication strategy is very handy and fast but Quarkus wants to go one step further by also ensuring a reliability of the ecosystem for the people who will use the extensions. Think about it, we all had a poor Developer Experience with an unmaintained library, an incompatibility between dependencies (and we don't even talk about legal issues). That's why there is the Quarkus Platform.
ja_jp: エクステンションの開発者の立場からすると、Maven の公開戦略は非常に便利で高速ですが、Quarkus は、エクステンションを使用する人々のためにエコシステムの信頼性も確保することで、さらに一歩進んでいきたいと考えています。考えてみてください。私たちは皆、メンテナンスされていないライブラリや依存関係間の非互換性 (法的な問題は除く) で、開発体験が著しく低下したことを経験していることでしょう。Quarkus Platform は、そのためのものです。

source: From an extension developer standpoint, the Maven publication strategy is very handy and fast, but Quarkus wants to go one step further by also ensuring a reliability of the ecosystem for the people who will use the extensions. Think about it, we all had a poor Developer Experience with an unmaintained library, an incompatibility between dependencies (and we don't even talk about legal issues). That's why there is the Quarkus Platform.
ja_jp: エクステンション開発者の視点から見ると、Maven の公開戦略は非常に便利で高速ですが、Quarkus はさらに一歩進んで、エクステンションを使用する人々にとってエコシステムの信頼性を確保したいと考えています。考えてみてください、私たちは皆、メンテナンスされていないライブラリーや依存関係間の非互換性 (法的な問題については触れません) によって、開発者体験が乏しかった経験があるはずです。Quarkus Platform はそのために存在します。

source: From an organizational perspective, the Polaris team is hard at work transferring their Quarkus knowledge and experiences to other groups within the organization through things like internal TechTalks. One of their biggest challenges is overcoming the hesitancy to change to other Java frameworks which often requires a steep learning curve.
ja_jp: 組織的な観点から見ると、Polarisチームは社内のTechTalksなどを通じて、Quarkusの知識や経験を組織内の他のグループに伝えることに懸命に取り組んでいます。彼らの最大の課題の1つは、急な学習曲線を必要とすることが多い他のJavaフレームワークへの変更をためらう気持ちを克服することです。

source: From field
ja_jp: フィールドから

source: From inside IntelliJ IDEA select `File -> New -> Project From Existing Sources...` or, if you are on the welcome dialog, select `Import project`.
ja_jp: IntelliJ IDEAの内部から `File → New → Project From Existing Sources…​` を選択するか、ウェルカム・ダイアログからであれば、 `Import project` を選択してください。

source: From inside IntelliJ select `File -> New -> Project From Existing Sources...` or, if you are on the welcome dialog, select `Import project`.
ja_jp: IntelliJの内部から `File → New → Project From Existing Sources…​` を選択するか、ウェルカム・ダイアログであれば `Import project` を選択してください。

source: From inside a Quarkus project, you can obtain a list of the available extensions with:
ja_jp: Quarkusプロジェクトの内部から、利用可能なエクステンションのリストを取得することができます。

source: From inside the tools container (as privileged user) run the native executable through `perf`:
ja_jp: ツールコンテナー内から (特権ユーザーとして)、 `perf` を介してネイティブ実行可能ファイルを実行します。

source: From now on, quarkus-jacoco can also be used to measure test coverage of Quarkus extensions.
ja_jp: これからは、quarkus-jacoco を使用して Quarkus エクステンションのテストカバレッジを測定することもできるようになります。

source: From one `ConfigMap` field
ja_jp: ある `ConfigMap` フィールドから

source: From one `Secret` field
ja_jp: ある `Secret` フィールドから

source: From sequential to continuation style
ja_jp: シーケンシャルから継続タイルへ

source: From the +quarkus-super-heroes+ directory, simply run the https://github.com/quarkusio/quarkus-super-heroes#running-locally-via-docker-compose[command based on the version of the application you want to run^]. For example, to run the native Java 17 version, run `+docker-compose -f deploy/docker-compose/native-java17.yml -f deploy/docker-compose/prometheus.yml up+`.
ja_jp: quarkus-super-heroesディレクトリから、 link:https://github.com/quarkusio/quarkus-super-heroes#running-locally-via-docker-compose[実行したいアプリケーションのバージョンに応じたコマンド, window=_blank]を実行するだけです。例えば、ネイティブのJava 17バージョンを実行するには、 `docker-compose -f deploy/docker-compose/native-java17.yml -f deploy/docker-compose/prometheus.yml up` を実行します。

source: From the `quarkus dev` console, type `j` to change the application global log level.
ja_jp: アプリケーションのグローバルログレベルを変更するには、 `quarkus dev` コンソールから `j` と入力します。

source: From the application directory, run the `issue-certificate` command to acquire your first Let's Encrypt certificate:
ja_jp: アプリケーションディレクトリーから `issue-certificate` コマンドを実行して、最初の Let's Encrypt 証明書を取得します。

source: From the application jar
ja_jp: アプリケーションjarから

source: From the classes above, we have enough to persist and fetch persons from different databases, so it's possible to see how it works.
ja_jp: 上記のクラスから、さまざまなデータベースから persons を永続化して取得するのに十分な情報が得られるため、どのように機能するかを確認できます。

source: From the implementation above, tenants are resolved from the request path so that in case no tenant could be inferred, `null` is returned to indicate that the default tenant configuration should be used.
ja_jp: 上記の実装から、テナントはリクエストパスから解決されるため、テナントを推測できなかった場合は、デフォルトのテナント設定を使用する必要があることを示すために null が返されます。

source: From the implementation above, tenants are resolved from the request path so that in case no tenant could be inferred, the default tenant identifier is returned.
ja_jp: 上記の実装ではテナントはリクエストパスから解決されるので、テナントが推測できない場合はデフォルトのテナント識別子が返されます。
